idx2class = {
    0: "Археология",
    1: "Оружие",
    2: "Прочие",
    3: "Нумизматика",
    4: "Фото, негативы",
    5: "Редкие книги",
    6: "Документы",
    7: "Печатная продукция",
    8: "ДПИ",
    9: "Скульптура",
    10: "Графика",
    11: "Техника",
    12: "Живопись",
    13: "Естественнонауч.коллекция",
    14: "Минералогия"
}

class2idx = {
    "Археология": 0,
    "Оружие": 1,
    "Прочие": 2,
    "Нумизматика": 3,
    "Фото, негативы": 4,
    "Редкие книги": 5,
    "Документы": 6,
    "Печатная продукция": 7,
    "ДПИ": 8,
    "Скульптура": 9,
    "Графика": 10,
    "Техника": 11,
    "Живопись": 12,
    "Естественнонауч.коллекция": 13,
    "Минералогия": 14
}