name: "ensemble_model_caption"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "input"
    data_type: TYPE_FP16
    dims: [3, 364, 364]
  }
]
output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [1]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "vision_model"
      model_version: -1
      input_map {
        key: "input"
        value: "input"
      }
      output_map {
        key: "output"
        value: "output"
      }
    },
    {
      model_name: "text_model"
      model_version: -1
      input_map {
        key: "visual_features"
        value: "output"
      }

      output_map {
        key: "text_output"
        value: "text_output"
      }
    }
  ]
}